STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_syscfg.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_ll_syscfg.h
  * @brief   Header file of LL syscfg module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_LL_SYSCFG_H
#define STM32U5XX_LL_SYSCFG_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

/** @defgroup LL_SYSCFG LL syscfg
  * @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup LL_Syscfg_Private_Constants LL syscfg private constants
  * @{
  */
#if defined(SYSCFG_CFGR1_ENDCAP)
/** @defgroup SYSCFG_DECOUPLING_CAPACITANCE SYSCFG decoupling capacitance
  * @{
  */
#define LL_SYSCFG_HSPI_CAPA_OFF      0x0U                  /*!< Capacitance off on HSPI supply  */
#define LL_SYSCFG_HSPI_CAPA_1_DIV_3  SYSCFG_CFGR1_ENDCAP_0 /*!< 1/3 capacitance on HSPI supply  */
#define LL_SYSCFG_HSPI_CAPA_2_DIV_3  SYSCFG_CFGR1_ENDCAP_1 /*!< 2/3 capacitance on HSPI supply  */
#define LL_SYSCFG_HSPI_CAPA_FULL     SYSCFG_CFGR1_ENDCAP   /*!< Full capacitance on HSPI supply */
/**
  * @}
  */
#endif /* SYSCFG_CFGR1_ENDCAP */

/** @defgroup SYSCFG_ANALOG_SWITCHE SYSCFG I/O analog switch supply
  * @{
  */
#define LL_SYSCFG_VDDA_SUPPLY    0U                     /*!< Analog IO switch to VDDA supply     */
#define LL_SYSCFG_BOOSTER_SUPPLY SYSCFG_CFGR1_BOOSTEN   /*!< Analog IO switch to booster supply  */
#define LL_SYSCFG_VDD_2V4_SUPPLY SYSCFG_CFGR1_ANASWVDD  /*!< Analog IO switch to VDD 2.4V supply */
/**
  * @}
  */

/** @defgroup SYSCFG_LL_EC_CCELL_CODE SYSCFG compensation cell Code source
  * @{
  */
#define LL_SYSCFG_CCELL_DEFAULT_CODE 0U /*!< I/Os code from the cell (available in the SYSCFG_CCVR) */
#define LL_SYSCFG_CCELL_CUSTOM_CODE  1U /*!< I/Os code from the SYSCFG compensation cell code register
                                                    (SYSCFG_CCCR) */
/**
  * @}
  */

/** @defgroup SYSCFG_LL_EC_CS1 SYSCFG Vdd compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_CCELL_VDDIO_DEFAULT_CODE 0U               /*!< VDD I/Os code from the cell
                                                                        (available in the SYSCFG_CCVR) */
#define LL_SYSCFG_CCELL_VDDIO_CUSTOM_CODE  SYSCFG_CCCSR_CS1 /*!< VDD I/Os code from the SYSCFG compensation
                                                                        cell code register (SYSCFG_CCCR)*/
/**
  * @}
  */

/** @defgroup SYSCFG_LL_EC_CS2 SYSCFG VddIO2 compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_CCELL_VDDIO2_DEFAULT_CODE 0U               /*!< VDDIO2 I/Os code from the cell (available in
                                                                         the SYSCFG_CCVR) */
#define LL_SYSCFG_CCELL_VDDIO2_CUSTOM_CODE  SYSCFG_CCCSR_CS2 /*!< VDDIO2 I/Os code from the SYSCFG compensation
                                                                         cell code register (SYSCFG_CCCR)*/
/**
  * @}
  */

#if defined(SYSCFG_CCCSR_CS3)
/** @defgroup SYSCFG_LL_EC_CS3 SYSCFG VddHSPI compensation cell Code selection
  * @{
  */
#define LL_SYSCFG_CCELL_HSPIIO_DEFAULT_CODE 0U               /*!< VDD HSPI I/Os code from the cell (available
                                                                         in the SYSCFG_CCVR) */
#define LL_SYSCFG_CCELL_HSPIIO_CUSTOM_CODE  SYSCFG_CCCSR_CS3 /*!< VDD HSPI I/Os code from the SYSCFG compensation
                                                                         cell code register (SYSCFG_CCCR) */
/**
  * @}
  */
#endif /* SYSCFG_CCCSR_CS3 */

/** @defgroup SYSCFG_LL_EC_ERASE_MEMORIES_STATUS SYSCFG MEMORIES ERASE STATUS
  * @{
  */
#define LL_SYSCFG_IPMEE_ERASE_ON_GOING  0U                /*!< Memory erase ongoing */
#define LL_SYSCFG_IPMEE_ERASE_ENDED     SYSCFG_MESR_IPMEE /*!< Memory erase done    */

#define LL_SYSCFG_MCLR_ERASE_ON_GOING   0U                /*!< Memory erase ongoing */
#define LL_SYSCFG_MCLR_ERASE_ENDED      SYSCFG_MESR_MCLR  /*!< Memory erase done    */
/**
  * @}
  */

/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/

/** @defgroup SYSCFG_LL_Exported_Constants SYSCFG Exported Constants
  * @{
  */


/** @defgroup SYSCFG_LL_EC_FASTMODEPLUS SYSCFG fast mode plus
  * @{
  */
#define LL_SYSCFG_DRIVE_PB6 SYSCFG_CFGR1_PB6_FMP  /*!< Enables the Fast Mode Plus on PB6 */
#define LL_SYSCFG_DRIVE_PB7 SYSCFG_CFGR1_PB7_FMP  /*!< Enables the Fast Mode Plus on PB7 */
#define LL_SYSCFG_DRIVE_PB8 SYSCFG_CFGR1_PB8_FMP  /*!< Enables the Fast Mode Plus on PB8 */
#define LL_SYSCFG_DRIVE_PB9 SYSCFG_CFGR1_PB9_FMP  /*!< Enables the Fast Mode Plus on PB9 */
#define LL_SYSCFG_DRIVE_ALL (SYSCFG_CFGR1_PB6_FMP | SYSCFG_CFGR1_PB7_FMP | \
                             SYSCFG_CFGR1_PB8_FMP | SYSCFG_CFGR1_PB9_FMP)
/*!< Enables all Fast mode plus driving capability */
/**
  * @}
  */

/** @defgroup SYSCFG_LL_EC_FLOATING_POINT_UNIT_INTERRUPTs SYSCFG floating point unit interrupts
  * @{
  */
#define LL_SYSCFG_IT_FPU_IOC SYSCFG_FPUIMR_FPU_IE_0 /*!< Invalid operation interrupt                    */
#define LL_SYSCFG_IT_FPU_DZC SYSCFG_FPUIMR_FPU_IE_1 /*!< Divide-by-zero interrupt                       */
#define LL_SYSCFG_IT_FPU_UFC SYSCFG_FPUIMR_FPU_IE_2 /*!< underflow interrupt                            */
#define LL_SYSCFG_IT_FPU_OFC SYSCFG_FPUIMR_FPU_IE_3 /*!< Overflow interrupt                             */
#define LL_SYSCFG_IT_FPU_IDC SYSCFG_FPUIMR_FPU_IE_4 /*!< Input abnormal interrupt                       */
#define LL_SYSCFG_IT_FPU_IXC SYSCFG_FPUIMR_FPU_IE_5 /*!< Inexact interrupt                              */
#define LL_SYSCFG_IT_FPU_ALL (SYSCFG_FPUIMR_FPU_IE_0 | SYSCFG_FPUIMR_FPU_IE_1 | SYSCFG_FPUIMR_FPU_IE_2 | \
                              SYSCFG_FPUIMR_FPU_IE_3 | SYSCFG_FPUIMR_FPU_IE_4 | SYSCFG_FPUIMR_FPU_IE_5)
/*!< All floating point unit interrupts interrupt   */

/**
  * @}
  */

/** @defgroup SYSCFG_LL_EC_TIMBREAK SYSCFG TIMER BREAK
  * @{
  */
#define LL_SYSCFG_FLASH_ECC_DOUBLE_ERROR SYSCFG_CFGR2_ECCL /*!< Enables and locks the FLASH ECC error signal
                                                                  with Break Input of TIM1/8/15/16/17 */
#define LL_SYSCFG_PVD                    SYSCFG_CFGR2_PVDL /*!< Enables and locks the PVD connection
                                                                  with TIM1/8/15/16/17 Break Input and also the PVDE
                                                                  and PLS bits of the Power Control Interface */
#define LL_SYSCFG_SRAM_ECC_DOUBLE_ERROR  SYSCFG_CFGR2_SPL /*!< Enables and locks the SRAM ECC double error signal
                                                                  with Break Input of TIM1/8/15/16/17 */
#define LL_SYSCFG_LOCKUP_OUT             SYSCFG_CFGR2_CLL  /*!< Enables and locks the LOCKUP output of CortexM33
                                                                  with Break Input of TIM1/15/16/17 */

#define LL_SYSCFG_TIM_BREAK_INPUTS_ALL   (SYSCFG_CFGR2_ECCL | SYSCFG_CFGR2_PVDL | \
                                          SYSCFG_CFGR2_SPL   | SYSCFG_CFGR2_CLL)
/*!< Enables and locks the all with Break Input
of TIM1/15/16/17 */
/**
  * @}
  */


#define LL_SYSCFG_CCELL_VDDIO      SYSCFG_CCCSR_EN1 /*!< Compensation cell selection for VDDIO  */
#define LL_SYSCFG_CCELL_VDDIO2     SYSCFG_CCCSR_EN2 /*!< Compensation cell selection for VDDIO2 */
#if defined(SYSCFG_CCCSR_EN3)
#define LL_SYSCFG_CCELL_HSPIIO     SYSCFG_CCCSR_EN3 /*!< Compensation cell selection for HSPIIO */
#endif /* SYSCFG_CCCSR__CCELLEN3 */
#if defined(SYSCFG_CCCSR_EN3)
#define LL_SYSCFG_CCELL_ALL        (SYSCFG_CCCSR_EN1 | SYSCFG_CCCSR_EN2 | SYSCFG_CCCSR_EN3)
#else
#define LL_SYSCFG_CCELL_ALL        (SYSCFG_CCCSR_EN1 | SYSCFG_CCCSR_EN2)
#endif /* SYSCFG_CCCSR_EN3 */

/** @defgroup SYSCFG_USB_PHY_RefenceClockFrequency SYSCFG USB PHY Reference Clock frequency
  * @{
  */
#define LL_SYSCFG_USBHSPHY_16MHZ   (SYSCFG_OTGHSPHYCR_CLKSEL_0 | SYSCFG_OTGHSPHYCR_CLKSEL_1) /*!< Clock frequency
                                                                                                         16 MHz */
#define LL_SYSCFG_USBHSPHY_19_2MHZ SYSCFG_OTGHSPHYCR_CLKSEL_3                                /*!< Clock frequency
                                                                                                         19.2 MHz */
#define LL_SYSCFG_USBHSPHY_20MHZ   (SYSCFG_OTGHSPHYCR_CLKSEL_0 | SYSCFG_OTGHSPHYCR_CLKSEL_3) /*!< Clock frequency
                                                                                                         20 MHz */
#define LL_SYSCFG_USBHSPHY_24MHZ   (SYSCFG_OTGHSPHYCR_CLKSEL_1 | SYSCFG_OTGHSPHYCR_CLKSEL_3) /*!< Clock frequency
                                                                                                         24 MHz   */
#define LL_SYSCFG_USBHSPHY_26MHZ   (SYSCFG_OTGHSPHYCR_CLKSEL_1 | SYSCFG_OTGHSPHYCR_CLKSEL_2 | \
                                    SYSCFG_OTGHSPHYCR_CLKSEL_3)                              /*!< Clock frequency
                                                                                                         26 MHz   */
#define LL_SYSCFG_USBHSPHY_32MHZ   (SYSCFG_OTGHSPHYCR_CLKSEL_0 | SYSCFG_OTGHSPHYCR_CLKSEL_1 | \
                                    SYSCFG_OTGHSPHYCR_CLKSEL_3)                              /*!< Clock frequency
                                                                                                         32 MHz   */
/**
  * @}
  */

/** @defgroup SYSCFG_USBHSPHY_TRANSMITTER_PREEMPHASIS_CURRENT SYSCFG USB HS PHY transmitter preemphasis current
  * @{
  */
#define LL_SYSCFG_SRC_CURRENT_NO 0U                                      /*!< Transmitter preemphasis disabled */
#define LL_SYSCFG_SRC_CURRENT_1  SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE_0 /*!< Transmitter preemphasis circuit
                                                                                     sources 1x */
#define LL_SYSCFG_SRC_CURRENT_2  SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE_1 /*!< Transmitter preemphasis circuit
                                                                                     sources 2x */
#define LL_SYSCFG_SRC_CURRENT_3  SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE   /*!< Transmitter preemphasis circuit
                                                                                     sources 3x */
/**
  * @}
  */

/** @defgroup SYSCFG_SQUELCH_THRESHOLD_ADJUSTMENT SYSCFG squelch threshold adjustment
  * @{
  */
#define LL_SYSCFG_SQUELCH_ADJUST_0_PERCENT       (SYSCFG_OTGHSPHYTUNER2_SQRXTUNE_0 \
                                                  | SYSCFG_OTGHSPHYTUNER2_SQRXTUNE_1)  /*!< 0% (default value) */

