STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_syscfg.h
#define LL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT 0U   /*!< +15% (recommended value) */

/**
  * @}
  */

/** @defgroup SYSCFG_DISCONNECT_THRESHOLD_ADJUSTMENT SYSCFG disconnect threshold adjustment
  * @{
  */
#define LL_SYSCFG_DIS_ADJUST_0_PERCENT        SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE_0 /*!< Adjusts the voltage level
                        for the threshold used to detect a disconnect event at the host by 0% (default value) */
#define LL_SYSCFG_DIS_ADJUST_PLUS_5_9_PERCENT SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE_1 /*!< Adjusts the voltage level
                        for the threshold used to detect a disconnect event at the host by +5.9% (recommended value) */
/**
  * @}
  */

/** @defgroup SYSCFG_LL_EC_SECURE_ATTRIBUTES Secure attributes
  * @note Only available when syscfg implements security (TZEN=1)
  * @{
  */
#define LL_SYSCFG_CLOCK_SEC   SYSCFG_SECCFGR_SYSCFGSEC /*!< SYSCFG clock configuration secure-only access */
#define LL_SYSCFG_CLOCK_NSEC  0U                       /*!< SYSCFG clock configuration secure/non-secure access*/
#define LL_SYSCFG_CLASSB_SEC  SYSCFG_SECCFGR_CLASSBSEC /*!< Class B configuration secure-only access */
#define LL_SYSCFG_CLASSB_NSEC 0U                       /*!< Class B configuration secure/non-secure access */
#define LL_SYSCFG_FPU_SEC     SYSCFG_SECCFGR_FPUSEC    /*!< FPU configuration secure-only access */
#define LL_SYSCFG_FPU_NSEC    0U                       /*!< FPU configuration secure/non-secure access */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SYSCFG_LL_Exported_Macros SYSCFG Exported Macros
  * @{
  */

/** @defgroup SYSCFG_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in SYSCFG register
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_SYSCFG_WRITE_REG(reg, value) WRITE_REG(SYSCFG->reg, (value))

/**
  * @brief  Read a value in SYSCFG register
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_SYSCFG_READ_REG(reg) READ_REG(SYSCFG->reg)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup LL_Syscfg_Exported_Functions LL syscfg exported functions
  * @{
  */

/**
  * @brief  Set I/O analog switch supply.
  * @rmtoll
  *  SYSCFG_CFGR1 ANASWVDD BOOSTEN   LL_SYSCFG_SetAnalogIOSwitchSupply
  * @param  analog_switch This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_VDDA_SUPPLY
  *         @arg @ref LL_SYSCFG_BOOSTER_SUPPLY
  *         @arg @ref LL_SYSCFG_VDD_2V4_SUPPLY
  */
__STATIC_INLINE void LL_SYSCFG_SetAnalogIOSwitchSupply(uint32_t analog_switch)
{
  MODIFY_REG(SYSCFG->CFGR1, (SYSCFG_CFGR1_BOOSTEN | SYSCFG_CFGR1_ANASWVDD), analog_switch);
}

/**
  * @brief  Get I/O analog switch supply.
  * @rmtoll
  *  SYSCFG_CFGR1 ANASWVDD  LL_SYSCFG_GetAnalogIOSwitchSupply \n
  *  SYSCFG_CFGR1 BOOSTEN   LL_SYSCFG_GetAnalogIOSwitchSupply
  * @retval Returned This value can be one of the following values:
  *         @arg @ref LL_SYSCFG_VDDA_SUPPLY
  *         @arg @ref LL_SYSCFG_BOOSTER_SUPPLY
  *         @arg @ref LL_SYSCFG_VDD_2V4_SUPPLY
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetAnalogIOSwitchSupply(void)
{
  return (READ_BIT(SYSCFG->CFGR1, (SYSCFG_CFGR1_BOOSTEN | SYSCFG_CFGR1_ANASWVDD)));
}

/**
  * @brief  Enable I/O analog switches supplied by VDD.
  * @rmtoll
  *  SYSCFG_CFGR1 ANASWVDD      LL_SYSCFG_EnableAnalogSwitchVdd
  */
__STATIC_INLINE void LL_SYSCFG_EnableAnalogSwitchVdd(void)
{
  SET_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_ANASWVDD);
}

/**
  * @brief  Disable I/O analog switches supplied by VDD.
  * @rmtoll
  *  SYSCFG_CFGR1 ANASWVDD      LL_SYSCFG_DisableAnalogSwitchVdd
  * @note   I/O analog switches are supplied by VDDA or booster
  *         when booster in on.
  *         Dedicated voltage booster (supplied by VDD) is the recommended
  *         configuration with low VDDA voltage operation.
  */
__STATIC_INLINE void LL_SYSCFG_DisableAnalogSwitchVdd(void)
{
  CLEAR_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_ANASWVDD);
}

/**
  * @brief  Enable I/O analog switch voltage booster.
  * @rmtoll
  *  SYSCFG_CFGR1 BOOSTEN       LL_SYSCFG_EnableAnalogBooster
  * @note   When voltage booster is enabled, I/O analog switches are supplied
  *         by a dedicated voltage booster, from VDD power domain. This is
  *         the recommended configuration with low VDDA voltage operation.
  * @note   The I/O analog switch voltage booster is relevant for peripherals
  *         using I/O in analog input: ADC, COMP, OPAMP.
  *         However, COMP and OPAMP inputs have a high impedance and
  *         voltage booster does not impact performance significantly.
  *         Therefore, the voltage booster is mainly intended for
  *         usage with ADC.
  */
__STATIC_INLINE void LL_SYSCFG_EnableAnalogBooster(void)
{
  SET_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_BOOSTEN);
}

/**
  * @brief  Disable I/O analog switch voltage booster.
  * @rmtoll
  *  SYSCFG_CFGR1 BOOSTEN       LL_SYSCFG_DisableAnalogBooster
  * @note   When voltage booster is enabled, I/O analog switches are supplied
  *         by a dedicated voltage booster, from VDD power domain. This is
  *         the recommended configuration with low VDDA voltage operation.
  * @note   The I/O analog switch voltage booster is relevant for peripherals
  *         using I/O in analog input: ADC, COMP, OPAMP.
  *         However, COMP and OPAMP inputs have a high impedance and
  *         voltage booster does not impact performance significantly.
  *         Therefore, the voltage booster is mainly intended for
  *         usage with ADC.
  */
__STATIC_INLINE void LL_SYSCFG_DisableAnalogBooster(void)
{
  CLEAR_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_BOOSTEN);
}

/**
  * @brief  Enable the fast mode plus driving capability.
  * @rmtoll
  *  SYSCFG_CFGR1 PBx_FMP   LL_SYSCFG_EnableFastModePlus
  * @param  fast_mode_plus This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_DRIVE_PB6
  *         @arg @ref LL_SYSCFG_DRIVE_PB7
  *         @arg @ref LL_SYSCFG_DRIVE_PB8
  *         @arg @ref LL_SYSCFG_DRIVE_PB9
  */
__STATIC_INLINE void LL_SYSCFG_EnableFastModePlus(uint32_t fast_mode_plus)
{
  SET_BIT(SYSCFG->CFGR1, fast_mode_plus);
}

/**
  * @brief  Disable the fast mode plus driving capability.
  * @rmtoll
  *  SYSCFG_CFGR1 PBx_FMP   LL_SYSCFG_DisableFastModePlus
  * @param  fast_mode_plus This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_DRIVE_PB6
  *         @arg @ref LL_SYSCFG_DRIVE_PB7
  *         @arg @ref LL_SYSCFG_DRIVE_PB8
  *         @arg @ref LL_SYSCFG_DRIVE_PB9
  */
__STATIC_INLINE void LL_SYSCFG_DisableFastModePlus(uint32_t fast_mode_plus)
{
  CLEAR_BIT(SYSCFG->CFGR1, fast_mode_plus);
}

/**
  * @brief  Check if fast mode plus is enabled or disabled.
  * @rmtoll
  *  SYSCFG_CFGR1 PB6_FMP   LL_SYSCFG_IsEnabledFastModePlus \n
  *  SYSCFG_CFGR1 PB7_FMP   LL_SYSCFG_IsEnabledFastModePlus \n
  *  SYSCFG_CFGR1 PB8_FMP   LL_SYSCFG_IsEnabledFastModePlus \n
  *  SYSCFG_CFGR1 PB9_FMP   LL_SYSCFG_IsEnabledFastModePlus
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledFastModePlus(uint32_t fast_mode_plus)
{
  return ((READ_BIT(SYSCFG->CFGR1, fast_mode_plus) == fast_mode_plus) ? 1UL : 0UL);
}

#if defined(SYSCFG_CFGR1_ENDCAP)
/**
  * @brief  Set decoupling capacitance on HSPI supply.
  * @rmtoll
  *  SYSCFG_CFGR1 ENDCAP   LL_SYSCFG_SetHSPISupplyDecouplingCapacitance
  * @param  capacitance This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_OFF
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_1_DIV_3
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_2_DIV_3
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_FULL
  */
__STATIC_INLINE void LL_SYSCFG_SetHSPISupplyDecouplingCapacitance(uint32_t capacitance)
{
  MODIFY_REG(SYSCFG->CFGR1, SYSCFG_CFGR1_ENDCAP, capacitance);
}

/**
  * @brief  Get decoupling capacitance on HSPI supply.
  * @rmtoll
  *  SYSCFG_CFGR1 ENDCAP   LL_SYSCFG_GetHSPISupplyDecouplingCapacitance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_OFF
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_1_DIV_3
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_2_DIV_3
  *         @arg @ref LL_SYSCFG_HSPI_CAPA_FULL
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetHSPISupplyDecouplingCapacitance(void)
{
  return (READ_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_ENDCAP));
}
#endif /* SYSCFG_CFGR1_ENDCAP */

