STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_syscfg.h
#if defined(SYSCFG_CFGR1_SRAMCACHED)
/**
  * @brief  Enable internal SRAMs cacheability by DCACHE2.
  * @rmtoll
  *  SYSCFG_CFGR1 SRAMCACHED   LL_SYSCFG_EnableDCACHE2SRAMCacheability
  */
__STATIC_INLINE void LL_SYSCFG_EnableDCACHE2SRAMCacheability(void)
{
  SET_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_SRAMCACHED);
}

/**
  * @brief  Disable internal SRAMs cacheability by DCACHE2.
  * @rmtoll
  *  SYSCFG_CFGR1 SRAMCACHED   LL_SYSCFG_DisableDCACHE2SRAMCacheability
  */
__STATIC_INLINE void LL_SYSCFG_DisableDCACHE2SRAMCacheability(void)
{
  CLEAR_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_SRAMCACHED);
}

/**
  * @brief  Check if internal SRAMs cacheability by DCACHE2 is enabled or disabled.
  * @rmtoll
  *  SYSCFG_CFGR1 SRAMCACHED   LL_SYSCFG_IsEnabledDCACHE2SRAMCacheability
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledDCACHE2SRAMCacheability(void)
{
  return ((READ_BIT(SYSCFG->CFGR1, SYSCFG_CFGR1_SRAMCACHED) == SYSCFG_CFGR1_SRAMCACHED) ? 1UL : 0UL);
}
#endif /* SYSCFG_CFGR1_SRAMCACHED */

/**
  * @brief  Enable floating point unit interrupts bits.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_0   LL_SYSCFG_EnableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_1   LL_SYSCFG_EnableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_2   LL_SYSCFG_EnableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_3   LL_SYSCFG_EnableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_4   LL_SYSCFG_EnableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_5   LL_SYSCFG_EnableFPUIT
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_IT_FPU_IOC
  *         @arg @ref LL_SYSCFG_IT_FPU_DZC
  *         @arg @ref LL_SYSCFG_IT_FPU_UFC
  *         @arg @ref LL_SYSCFG_IT_FPU_OFC
  *         @arg @ref LL_SYSCFG_IT_FPU_IDC
  *         @arg @ref LL_SYSCFG_IT_FPU_IXC
  */
__STATIC_INLINE void LL_SYSCFG_EnableFPUIT(uint32_t floating_point)
{
  SET_BIT(SYSCFG->FPUIMR, floating_point);
}

/**
  * @brief  Disable floating point unit interrupts bits.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_0   LL_SYSCFG_DisableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_1   LL_SYSCFG_DisableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_2   LL_SYSCFG_DisableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_3   LL_SYSCFG_DisableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_4   LL_SYSCFG_DisableFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_5   LL_SYSCFG_DisableFPUIT
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_IT_FPU_IOC
  *         @arg @ref LL_SYSCFG_IT_FPU_DZC
  *         @arg @ref LL_SYSCFG_IT_FPU_UFC
  *         @arg @ref LL_SYSCFG_IT_FPU_OFC
  *         @arg @ref LL_SYSCFG_IT_FPU_IDC
  *         @arg @ref LL_SYSCFG_IT_FPU_IXC
  */
__STATIC_INLINE void LL_SYSCFG_DisableFPUIT(uint32_t floating_point)
{
  CLEAR_BIT(SYSCFG->FPUIMR, floating_point);
}

/**
  * @brief  Check if floating point unit interrupts bits is enabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_0   LL_SYSCFG_IsenabledFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_1   LL_SYSCFG_IsenabledFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_2   LL_SYSCFG_IsenabledFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_3   LL_SYSCFG_IsenabledFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_4   LL_SYSCFG_IsenabledFPUIT \n
  *  SYSCFG_FPUIMR FPU_IE_5   LL_SYSCFG_IsenabledFPUIT
  * @param  floating_point This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_IT_FPU_IOC
  *         @arg @ref LL_SYSCFG_IT_FPU_DZC
  *         @arg @ref LL_SYSCFG_IT_FPU_UFC
  *         @arg @ref LL_SYSCFG_IT_FPU_OFC
  *         @arg @ref LL_SYSCFG_IT_FPU_IDC
  *         @arg @ref LL_SYSCFG_IT_FPU_IXC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsenabledFPUIT(uint32_t floating_point)
{
  return ((READ_BIT(SYSCFG->FPUIMR, floating_point) == floating_point) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Invalid operation Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_0      LL_SYSCFG_EnableIT_FPU_IOC
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_IOC(void)
{
  SET_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_0);
}

/**
  * @brief  Disable Floating Point Unit Invalid operation Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_0      LL_SYSCFG_DisableIT_FPU_IOC
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_IOC(void)
{
  CLEAR_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_0);
}

/**
  * @brief  Check if Floating Point Unit Invalid operation Interrupt source is enabled or disabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_0      LL_SYSCFG_IsEnabledIT_FPU_IOC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_IOC(void)
{
  return ((READ_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_0) == SYSCFG_FPUIMR_FPU_IE_0) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Divide-by-zero Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_1      LL_SYSCFG_EnableIT_FPU_DZC
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_DZC(void)
{
  SET_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_1);
}

/**
  * @brief  Disable Floating Point Unit Divide-by-zero Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_1      LL_SYSCFG_DisableIT_FPU_DZC
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_DZC(void)
{
  CLEAR_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_1);
}

/**
  * @brief  Check if Floating Point Unit Divide-by-zero Interrupt source is enabled or disabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_1      LL_SYSCFG_IsEnabledIT_FPU_DZC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_DZC(void)
{
  return ((READ_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_1) == SYSCFG_FPUIMR_FPU_IE_1) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Underflow Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_2      LL_SYSCFG_EnableIT_FPU_UFC
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_UFC(void)
{
  SET_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_2);
}

/**
  * @brief  Disable Floating Point Unit Underflow Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_2      LL_SYSCFG_DisableIT_FPU_UFC
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_UFC(void)
{
  CLEAR_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_2);
}

/**
  * @brief  Check if Floating Point Unit Underflow Interrupt source is enabled or disabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_2      LL_SYSCFG_IsEnabledIT_FPU_UFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_UFC(void)
{
  return ((READ_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_2) == SYSCFG_FPUIMR_FPU_IE_2) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Overflow Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_3      LL_SYSCFG_EnableIT_FPU_OFC
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_OFC(void)
{
  SET_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_3);
}

/**
  * @brief  Disable Floating Point Unit Overflow Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_3      LL_SYSCFG_DisableIT_FPU_OFC
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_OFC(void)
{
  CLEAR_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_3);
}

/**
  * @brief  Check if Floating Point Unit Overflow Interrupt source is enabled or disabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_3      LL_SYSCFG_IsEnabledIT_FPU_OFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_OFC(void)
{
  return ((READ_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_3) == SYSCFG_FPUIMR_FPU_IE_3) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Input denormal Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_4      LL_SYSCFG_EnableIT_FPU_IDC
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_IDC(void)
{
  SET_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_4);
}

/**
  * @brief  Disable Floating Point Unit Input denormal Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_4      LL_SYSCFG_DisableIT_FPU_IDC
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_IDC(void)
{
  CLEAR_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_4);
}

/**
  * @brief  Check if Floating Point Unit Input denormal Interrupt source is enabled or disabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_4      LL_SYSCFG_IsEnabledIT_FPU_IDC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_IDC(void)
{
  return ((READ_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_4) == SYSCFG_FPUIMR_FPU_IE_4) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Inexact Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_5      LL_SYSCFG_EnableIT_FPU_IXC
  */
__STATIC_INLINE void LL_SYSCFG_EnableIT_FPU_IXC(void)
{
  SET_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_5);
}

/**
  * @brief  Disable Floating Point Unit Inexact Interrupt
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_5      LL_SYSCFG_DisableIT_FPU_IXC
  */
__STATIC_INLINE void LL_SYSCFG_DisableIT_FPU_IXC(void)
{
  CLEAR_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_5);
}

/**
  * @brief  Check if Floating Point Unit Inexact Interrupt source is enabled or disabled.
  * @rmtoll
  *  SYSCFG_FPUIMR FPU_IE_5      LL_SYSCFG_IsEnabledIT_FPU_IXC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledIT_FPU_IXC(void)
{
  return ((READ_BIT(SYSCFG->FPUIMR, SYSCFG_FPUIMR_FPU_IE_5) == SYSCFG_FPUIMR_FPU_IE_5) ? 1UL : 0UL);
}

/**
  * @brief  Set connections to TIM1/8/15/16/17 break inputs.
  * @rmtoll
  *  SYSCFG_CFGR2 CLL          LL_SYSCFG_EnableTIMBreakInputs \n
  *  SYSCFG_CFGR2 SPL          LL_SYSCFG_EnableTIMBreakInputs \n
  *  SYSCFG_CFGR2 PVDL         LL_SYSCFG_EnableTIMBreakInputs \n
  *  SYSCFG_CFGR2 ECCL         LL_SYSCFG_EnableTIMBreakInputs
  * @param  break_input This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SYSCFG_PVD
  *         @arg @ref LL_SYSCFG_SRAM_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SYSCFG_LOCKUP_OUT
  */
__STATIC_INLINE void LL_SYSCFG_EnableTIMBreakInputs(uint32_t break_input)
{
  MODIFY_REG(SYSCFG->CFGR2, (SYSCFG_CFGR2_CLL | SYSCFG_CFGR2_SPL | SYSCFG_CFGR2_PVDL | SYSCFG_CFGR2_ECCL), break_input);
}

/**
  * @brief  Get connections to TIM1/8/15/16/17 break inputs.
  * @rmtoll
  *  SYSCFG_CFGR2   CLL     LL_SYSCFG_IsEnabledTIMBreakInputs \n
  *  SYSCFG_CFGR2   SPL     LL_SYSCFG_IsEnabledTIMBreakInputs \n
  *  SYSCFG_CFGR2   PVDL    LL_SYSCFG_IsEnabledTIMBreakInputs \n
  *  SYSCFG_CFGR2   ECCL    LL_SYSCFG_IsEnabledTIMBreakInputs
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SYSCFG_PVD
  *         @arg @ref LL_SYSCFG_SRAM_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SYSCFG_LOCKUP_OUT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledTIMBreakInputs(uint32_t break_input)
{
  return ((READ_BIT(SYSCFG->CFGR2, break_input) == (break_input)) ? 1UL : 0UL);
}

/** @defgroup SYSCFG_LL_EF_COMPENSATION SYSCFG COMPENSATION
  * @{
  */

/**
  * @brief  Set the compensation cell code of each compensation cell.
  * @rmtoll CCCSR    CSx x= [1..3]  LL_SYSCFG_SetConfigCompensationCellCodeSource
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *         @arg @ref LL_SYSCFG_CCELL_ALL
  * @param  code_source: This parameter can be one of the following values:
  *         @arg LL_SYSCFG_CCELL_DEFAULT_CODE
  *         @arg LL_SYSCFG_CCELL_CUSTOM_CODE
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_SYSCFG_SetConfigCompensationCellCodeSource(uint32_t comp_cell, uint32_t code_source)
{
  ATOMIC_MODIFY_REG(SYSCFG->CCCSR, (comp_cell << 1U), (code_source * (comp_cell << 1U)));
}

/**
  * @brief  Get the compensation cell code.
  * @rmtoll
  *  SYSCFG_CCCSR    CS1    LL_SYSCFG_GetCompensationCellCode \n
  *  SYSCFG_CCCSR    CS2    LL_SYSCFG_GetCompensationCellCode \n
  *  SYSCFG_CCCSR    CS3    LL_SYSCFG_GetCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_CODE_DEFAULT: Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_CODE_CUSTOM: Selected Code is from the SYSCFG compensation
  *                                            cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetConfigCompensationCellCodeSource(uint32_t comp_cell)
{
  return (READ_BIT(SYSCFG->CCCSR, (SYSCFG_CCCSR_CS1 << POSITION_VAL(comp_cell))) >> POSITION_VAL(comp_cell << 1U));
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDD
  * @rmtoll
  *  CCCSR   CS1    LL_SYSCFG_SetVddIOCompensationCellCodeSource
  * @param  code_source: Select the code to be applied for the Vdd compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_VDDIO_DEFAULT_CODE: Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_VDDIO_CUSTOM_CODE: Select Code from the SYSCFG compensation cell code
  *                                                  register (SYSCFG_CCCR)
  */
__STATIC_INLINE void LL_SYSCFG_SetVddIOCompensationCellCodeSource(uint32_t code_source)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, code_source);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDD
  * @rmtoll
  *  CCCSR   CS1    LL_SYSCFG_GetVddIOCompensationCellCodeSource
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_VDDIO_DEFAULT_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_VDDIO_CUSTOM_CODE: Selected Code is from the SYSCFG compensation cell code
  *                                            register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddIOCompensationCellCodeSource(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_CS1));
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDDIO2
  * @rmtoll
  *  CCCSR   CS2    LL_SYSCFG_SetVddIO2CompensationCellCodeSource
  * @param  code_source: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_VDDIO2_DEFAULT_CODE: Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_VDDIO2_CUSTOM_CODE: Select Code from the SYSCFG compensation cell code
  *                                                   register (SYSCFG_CCCR)
  */
__STATIC_INLINE void LL_SYSCFG_SetVddIO2CompensationCellCodeSource(uint32_t code_source)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, code_source);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDDIO2
  * @rmtoll
  *  CCCSR   CS2    LL_SYSCFG_GetVddIO2CompensationCellCodeSource
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_VDDIO2_DEFAULT_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_VDDIO2_CUSTOM_CODE: Selected Code is from the SYSCFG compensation
  *   cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddIO2CompensationCellCodeSource(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_CS2));
}

#if defined(SYSCFG_CCCSR_CS3)
/**
  * @brief  Set the compensation cell code selection of HSPI IO supplied by VDD
  * @rmtoll
  *  CCCSR   CS3    LL_SYSCFG_SetVddHSPICompensationCellCodeSource
  * @param  code_source: Selects the code to be applied for the VddIO compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_HSPIIO_DEFAULT_CODE : Select Code from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_HSPIIO_CUSTOM_CODE: Select Code from the SYSCFG compensation cell code
  *                                                   register (SYSCFG_CCCR)
  */
__STATIC_INLINE void LL_SYSCFG_SetVddHSPICompensationCellCodeSource(uint32_t code_source)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, code_source);
}

/**
  * @brief  Get the compensation cell code selection of HSPI IO supplied by VDD
  * @rmtoll
  *  CCCSR   CS3    LL_SYSCFG_GetVddHSPICompensationCellCodeSource
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_CCELL_HSPIIO_DEFAULT_CODE : Selected Code is from the cell (available in the SYSCFG_CCVR)
  *   @arg LL_SYSCFG_CCELL_HSPIIO_CUSTOM_CODE: Selected Code is from the SYSCFG compensation
  *    cell code register (SYSCFG_CCCR)
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetVddHSPICompensationCellCodeSource(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_CS3));
}
#endif /* SYSCFG_CCCSR_CS3 */

/**
  * @brief  Enable the Compensation Cell.
  * @rmtoll CCCSR   ENX   X[1..3]    LL_SYSCFG_EnableCompensationCell
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *         @arg @ref LL_SYSCFG_CCELL_ALL
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_SYSCFG_EnableCompensationCell(uint32_t comp_cell)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, comp_cell);
}

/**
  * @brief  Disable the Compensation Cell.
  * @rmtoll CCCSR   ENX   X[1..3]    LL_SYSCFG_DisableCompensationCell
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  *         @arg @ref LL_SYSCFG_CCELL_ALL
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_SYSCFG_DisableCompensationCell(uint32_t comp_cell)
{
  ATOMIC_CLEAR_BIT(SYSCFG->CCCSR, comp_cell);
}

/**
  * @brief  Check if the Compensation Cell is enable
  * @rmtoll CCCSR   ENx x=[1..3]    LL_SYSCFG_IsEnabledCompensationCell
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledCompensationCell(uint32_t comp_cell)
{
  return ((READ_BIT(SYSCFG->CCCSR, comp_cell) == comp_cell) ? 1U : 0U);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDD
  * @rmtoll
  *  CCCSR   EN1    LL_SYSCFG_EnableVddIOCompensationCell
  * @note   The vdd compensation cell can be used only when the device supply
  *         voltage ranges from 1.71 to 3.6 V
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddIOCompensationCell(void)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN1);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDD
  * @rmtoll
  *  CCCSR   EN1    LL_SYSCFG_DisableVddIOCompensationCell
  * @note   The Vdd compensation cell can be used only when the device supply
  *         voltage ranges from 1.71 to 3.6 V
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddIOCompensationCell(void)
{
  ATOMIC_CLEAR_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN1);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDD is enable
  * @rmtoll
  *  CCCSR   EN1    LL_SYSCFG_IsEnabled_VddIOCompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddIOCompensationCell(void)
{
  return ((READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN1) == SYSCFG_CCCSR_EN1) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDDIO2
  * @rmtoll
  *  CCCSR   EN2    LL_SYSCFG_EnableVddIO2CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddIO2CompensationCell(void)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN2);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDDIO2
  * @rmtoll
  *  CCCSR   EN2    LL_SYSCFG_DisableVddIO2CompensationCell
  * @note   The Vdd I/O compensation cell can be used only when the device supply
  *         voltage ranges from 1.08 to 3.6 V
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddIO2CompensationCell(void)
{
  ATOMIC_CLEAR_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN2);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDDIO2 is enable
  * @rmtoll
  *  CCCSR   EN2   LL_SYSCFG_IsEnabled_VddIO2CompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddIO2CompensationCell(void)
{
  return ((READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN2) == SYSCFG_CCCSR_EN2) ? 1UL : 0UL);
}

