STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_syscfg.h
#if defined(SYSCFG_CCCSR_EN3)
/**
  * @brief  Enable the Compensation Cell of HSPI IO supplied by VDD
  * @rmtoll
  *  CCCSR   EN3    LL_SYSCFG_EnableVddHSPICompensationCell
  */
__STATIC_INLINE void LL_SYSCFG_EnableVddHSPICompensationCell(void)
{
  ATOMIC_SET_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN3);
}

/**
  * @brief  Disable the Compensation Cell of HSPI IO supplied by VDD
  * @rmtoll
  *  CCCSR   EN3    LL_SYSCFG_DisableVddHSPICompensationCell
  */
__STATIC_INLINE void LL_SYSCFG_DisableVddHSPICompensationCell(void)
{
  ATOMIC_CLEAR_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN3);
}

/**
  * @brief  Check if the Compensation Cell of HSPI IO supplied by VDD is enable
  * @rmtoll
  *  CCCSR   EN3   LL_SYSCFG_IsEnabled_VddHSPICompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabled_VddHSPICompensationCell(void)
{
  return ((READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_EN3) == SYSCFG_CCCSR_EN3) ? 1UL : 0UL);
}
#endif /* SYSCFG_CCCSR_EN3 */

/**
  * @brief  Get the PMOS transistor of the compensation cell value
  * @rmtoll CCVR    PCVx x=[1..3]   LL_SYSCFG_GetPMOSCompensationCellValue
  * @param  comp_cell The PMOS compensation cell
  * @retval Returned value of the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSCompensationCellValue(uint32_t comp_cell)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, ((SYSCFG_CCVR_NCV1 << (POSITION_VAL(comp_cell << 1U) * 4U))))
                    >> (POSITION_VAL(comp_cell << 1U) * 4U));
}

/**
  * @brief  Get the NMOS transistor of the compensation cell value
  * @rmtoll CCVR    NCVx x=[1..3]   LL_SYSCFG_GetNMOSCompensationCellValue
  * @param  comp_cell The NMOS compensation cell
  * @retval Returned value of the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSCompensationCellValue(uint32_t comp_cell)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, ((SYSCFG_CCVR_NCV1 << (POSITION_VAL(comp_cell) * 4U))))
                    >> (POSITION_VAL(comp_cell) * 4U));
}

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDD
  * @rmtoll
  *  CCVR    PCV1   LL_SYSCFG_GetPMOSVddIOCompensationCellValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIOCompensationCellValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, SYSCFG_CCVR_PCV1));
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDD
  * @rmtoll
  *  CCVR    NCV1   LL_SYSCFG_GetNMOSVddIOCompensationCellValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIOCompensationCellValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, SYSCFG_CCVR_NCV1));
}

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCVR    PCV2   LL_SYSCFG_GetPMOSVddIO2CompensationCellValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO2CompensationCellValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, SYSCFG_CCVR_PCV2));
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCVR    NCV2   LL_SYSCFG_GetNMOSVddIO2CompensationCellValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO2CompensationCellValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, SYSCFG_CCVR_NCV2));
}

#if defined(SYSCFG_CCVR_PCV3)
/**
  * @brief  Get the compensation cell value of the HSPI IO PMOS transistor supplied by VDD
  * @rmtoll
  *  CCVR    PCV3   LL_SYSCFG_GetPMOSVddHSPIIOCompensationCellValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddHSPIIOCompensationCellValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, SYSCFG_CCVR_PCV3));
}

/**
  * @brief  Get the compensation cell value of the HSPI IO NMOS transistor supplied by VDD
  * @rmtoll
  *  CCVR    NCV3   LL_SYSCFG_GetNMOSVddHSPIIOCompensationCellValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddHSPIIOCompensationCellValue(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCVR, SYSCFG_CCVR_NCV3));
}
#endif /* SYSCFG_CCVR_PCV3 */

/**
  * @brief  Set the compensation cell code of PMOS transistor
  * @rmtoll
  *  CCCR    PCC1   LL_SYSCFG_SetPMOSCompensationCellCode \n
  *  CCCR    PCC2   LL_SYSCFG_SetPMOSCompensationCellCode \n
  *  CCCR    PCC3   LL_SYSCFG_SetPMOSCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @param  pmos_code PMOS compensation code
  * @note   This code is applied to the PMOS compensation cell when the CSx x=[1..3] bits of the SYSCFG_CCCSR is set
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSCompensationCellCode(uint32_t comp_cell, uint32_t pmos_code)
{
  ATOMIC_MODIFY_REG(SYSCFG->CCCR, (SYSCFG_CCCR_NCC1 << (POSITION_VAL(comp_cell << 1U) * 4U)),
                    (pmos_code << (POSITION_VAL(comp_cell << 1U) * 4U)));
}

/**
  * @brief  Get the compensation cell code of PMOS transistor
  * @rmtoll
  *  CCCR    PCC1   LL_SYSCFG_GetPMOSCompensationCellCode \n
  *  CCCR    PCC2   LL_SYSCFG_GetPMOSCompensationCellCode \n
  *  CCCR    PCC3   LL_SYSCFG_GetPMOSCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   This code is applied to the PMOS compensation cell when the CSx x=[1..3] bits of the SYSCFG_CCCSR is set
  * @note   (*) value not defined in all devices
  * @retval Returned value of the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSCompensationCellCode(uint32_t comp_cell)
{
  return (READ_BIT(SYSCFG->CCCR, (SYSCFG_CCCR_NCC1 << (POSITION_VAL(comp_cell << 1U) * 4U))));
}

/**
  * @brief  Set the compensation cell code of NMOS transistor
  * @rmtoll
  *  CCCR    NCC1   LL_SYSCFG_SetNMOSCompensationCellCode \n
  *  CCCR    NCC2   LL_SYSCFG_SetNMOSCompensationCellCode \n
  *  CCCR    NCC3   LL_SYSCFG_SetNMOSCompensationCellCode (*)
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @param  nmos_code NMOS compensation code
  * @note   This code is applied to the PMOS compensation cell when the CSx x=[1..3] bits of the SYSCFG_CCCSR is set
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSCompensationCellCode(uint32_t comp_cell, uint32_t nmos_code)
{
  ATOMIC_MODIFY_REG(SYSCFG->CCCR, (SYSCFG_CCCR_NCC1 << (POSITION_VAL(comp_cell) * 4U)),
                    (nmos_code << (POSITION_VAL(comp_cell) * 4U)));
}

/**
  * @brief  Get the NMOS transistor of the compensation cell value
  * @rmtoll
  *  CCCR    PCC1   LL_SYSCFG_GetNMOSCompensationCellCode \n
  *  CCCR    PCC2   LL_SYSCFG_GetNMOSCompensationCellCode \n
  *  CCCR    PCC3   LL_SYSCFG_GetNMOSCompensationCellCode (*)
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO
  *         @arg @ref LL_SYSCFG_CCELL_VDDIO2
  * @if SYSCFG_CCCSR_EN3
  *         @arg @ref LL_SYSCFG_CCELL_HSPIIO (*)
  * @endif
  * @note   (*) value not defined in all devices
  * @note   This code is applied to the NMOS compensation cell when the CSx x=[1..3] bits of the SYSCFG_CCCSR is set
  * @retval Returned value of the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSCompensationCellCode(uint32_t comp_cell)
{
  return (READ_BIT(SYSCFG->CCCR, (SYSCFG_CCCR_NCC1 << (POSITION_VAL(comp_cell) * 4U))));
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS and NMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    NCC1  LL_SYSCFG_SetxMOSVddIOCompensationCellCode \n
  *  CCCR    PCC1  LL_SYSCFG_SetxMOSVddIOCompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS1 bit of the
  *         SYSCFG_CCCSR is set
  * @param  nmos_code NMOS compensation code
  */
__STATIC_INLINE void LL_SYSCFG_SetxMOSVddIOCompensationCellCode(uint32_t pmos_code, uint32_t nmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, (SYSCFG_CCCR_PCC1 | SYSCFG_CCCR_NCC1), ((pmos_code << SYSCFG_CCCR_PCC1_Pos) | \
                                                                   (nmos_code << SYSCFG_CCCR_NCC1_Pos)));
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS and NMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    NCC2  LL_SYSCFG_SetxMOSVddIO2CompensationCellCode \n
  *  CCCR    PCC2  LL_SYSCFG_SetxMOSVddIO2CompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  * @param  nmos_code NMOS compensation code
  */
__STATIC_INLINE void LL_SYSCFG_SetxMOSVddIO2CompensationCellCode(uint32_t pmos_code, uint32_t nmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, (SYSCFG_CCCR_PCC2 | SYSCFG_CCCR_NCC2), ((pmos_code << SYSCFG_CCCR_PCC2_Pos) | \
                                                                   (nmos_code << SYSCFG_CCCR_NCC2_Pos)));
}

