STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_syscfg.h
#if defined(SYSCFG_CCCR_PCC3)
/**
  * @brief  Set the compensation cell code of the GPIO PMOS and NMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCCR    NCC3  LL_SYSCFG_SetxMOSVddHSPIIOCompensationCellCode \n
  *  CCCR    PCC3  LL_SYSCFG_SetxMOSVddHSPIIOCompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS3 bit of the
  *         SYSCFG_CCCSR is set
  * @param  nmos_code NMOS compensation code
  */
__STATIC_INLINE void LL_SYSCFG_SetxMOSVddHSPIIOCompensationCellCode(uint32_t pmos_code, uint32_t nmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, (SYSCFG_CCCR_PCC3 | SYSCFG_CCCR_NCC3), ((pmos_code << SYSCFG_CCCR_PCC3_Pos) | \
                                                                   (nmos_code << SYSCFG_CCCR_NCC3_Pos)));
}
#endif /* SYSCFG_CCCR_PCC3 */

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    PCC1  LL_SYSCFG_SetPMOSVddIOCompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS1 bit of the
  *         SYSCFG_CCCSR is set
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddIOCompensationCellCode(uint32_t pmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, SYSCFG_CCCR_PCC1, pmos_code << SYSCFG_CCCR_PCC1_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    PCC1   LL_SYSCFG_GetPMOSVddIOCompensationCellCode
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIOCompensationCellCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCR, SYSCFG_CCCR_PCC1));
}

/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    PCC2  LL_SYSCFG_SetNMOSVddIOCompensationCellCode
  * @param  nmos_code NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddIOCompensationCellCode(uint32_t nmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, SYSCFG_CCCR_NCC1, nmos_code << SYSCFG_CCCR_NCC1_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    NCC1   LL_SYSCFG_GetNMOSVddIOCompensationCellCode
  * @retval Returned value is the Vdd compensation cell code for NMOS transistors
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIOCompensationCellCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCR, SYSCFG_CCCR_NCC1));
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCCR    PCC2  LL_SYSCFG_SetPMOSVddIO2CompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CCCSR is set
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddIO2CompensationCellCode(uint32_t pmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, SYSCFG_CCCR_PCC2, pmos_code << SYSCFG_CCCR_PCC2_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCCR    PCC2   LL_SYSCFG_GetPMOSVddIO2CompensationCellCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddIO2CompensationCellCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCR, SYSCFG_CCCR_PCC2));
}

/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCCR    NCC2  LL_SYSCFG_SetNMOSVddIO2CompensationCellCode
  * @param  nmos_code NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS2 bit of the
  *         SYSCFG_CMPCR is set
  */
__STATIC_INLINE void LL_SYSCFG_SetNMOSVddIO2CompensationCellCode(uint32_t nmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, SYSCFG_CCCR_NCC2, nmos_code << SYSCFG_CCCR_NCC2_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDDIO2
  * @rmtoll
  *  CCCR    NCC2   LL_SYSCFG_GetNMOSVddIO2CompensationCellCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddIO2CompensationCellCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCR, SYSCFG_CCCR_NCC2));
}

#if defined(SYSCFG_CCCR_PCC3)
/**
  * @brief  Set the compensation cell code of the HSPI IO PMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    PCC3  LL_SYSCFG_SetPMOSVddHSPIIOCompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS3 bit of the
  *         SYSCFG_CCCSR is set
  */
__STATIC_INLINE void LL_SYSCFG_SetPMOSVddHSPIIOCompensationCellCode(uint32_t pmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, SYSCFG_CCCR_PCC3, pmos_code << SYSCFG_CCCR_PCC3_Pos);
}

/**
  * @brief  Get the compensation cell code of the HSPI IO PMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    PCC3   LL_SYSCFG_GetPMOSVddHSPIIOCompensationCellCode
  * @retval Returned value is the PMOS compensation
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetPMOSVddHSPIIOCompensationCellCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCR, SYSCFG_CCCR_PCC3));
}

/**
  * @brief  Set the compensation cell code of the HSPI IO NMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    NCC3  LL_SYSCFG_SetNMOSVddHSPIIOCompensationCellCode
  * @param  nmos_code NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS3 bit of the
  *         SYSCFG_CCCSR is set
  */

__STATIC_INLINE void LL_SYSCFG_SetNMOSVddHSPIIOCompensationCellCode(uint32_t nmos_code)
{
  MODIFY_REG(SYSCFG->CCCR, SYSCFG_CCCR_NCC3, nmos_code << SYSCFG_CCCR_NCC3_Pos);
}

/**
  * @brief  Get the compensation cell code of the HSPI IO NMOS transistor supplied by VDD
  * @rmtoll
  *  CCCR    NCC3   LL_SYSCFG_GetNMOSVddHSPIIOCompensationCellCode
  * @retval Returned value is the NMOS compensation cell code
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetNMOSVddHSPIIOCompensationCellCode(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CCCR, SYSCFG_CCCR_NCC3));
}
#endif /* SYSCFG_CCCR_PCC3 */

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDD
  * @rmtoll
  *  CCCSR   RDY1   LL_SYSCFG_IsActiveFlag_RDY1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_RDY1(void)
{
  return ((READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_RDY1) == (SYSCFG_CCCSR_RDY1)) ? 1UL : 0UL);
}

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDDIO2
  * @rmtoll
  *  CCCSR   RDY2   LL_SYSCFG_IsActiveFlag_RDY2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_RDY2(void)
{
  return ((READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_RDY2) == (SYSCFG_CCCSR_RDY2)) ? 1UL : 0UL);
}

#if defined(SYSCFG_CCCSR_RDY3)
/**
  * @brief  Get Compensation Cell ready Flag of HSPI IO supplied by VDD
  * @rmtoll
  *  CCCSR   RDY3   LL_SYSCFG_IsActiveFlag_RDY3
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_RDY3(void)
{
  return ((READ_BIT(SYSCFG->CCCSR, SYSCFG_CCCSR_RDY3) == (SYSCFG_CCCSR_RDY3)) ? 1UL : 0UL);
}
#endif /* SYSCFG_CCCSR_RDY3 */

/**
  * @}
  */

/** @defgroup SYSCFG_LL_EF_USB_HS_PHY SYSCFG USB HS PHY
  * @{
  */

#if defined(SYSCFG_OTGHSPHYCR_EN)
/**
  * @brief  Enable the USB HS PHY feature.
  * @rmtoll
  *  OTGHSPHYCR    EN   LL_SYSCFG_EnableUSBHSPHY
  */
__STATIC_INLINE void LL_SYSCFG_EnableUSBHSPHY(void)
{
  SET_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_EN);
}

/**
  * @brief  Disable the USB HS PHY feature.
  * @rmtoll
  *  OTGHSPHYCR    EN   LL_SYSCFG_DisableUSBHSPHY
  */
__STATIC_INLINE void LL_SYSCFG_DisableUSBHSPHY(void)
{
  CLEAR_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_EN);
}

/**
  * @brief  Check that USB HS PHY is enabled.
  * @rmtoll
  *  OTGHSPHYCR    EN   LL_SYSCFG_IsEnabledUSBHSPHY
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledUSBHSPHY(void)
{
  return ((READ_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_EN) == (SYSCFG_OTGHSPHYCR_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the USB HS PHY  Power-Down control.
  * @rmtoll
  *  OTGHSPHYCR    PDCTRL   LL_SYSCFG_EnableUSBHSPHYPowerDown
  */
__STATIC_INLINE void LL_SYSCFG_EnableUSBHSPHYPowerDown(void)
{
  CLEAR_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_PDCTRL);
}

/**
  * @brief  Disable the USB HS PHY  Power-Down control.
  * @rmtoll
  *  OTGHSPHYCR    PDCTRL   LL_SYSCFG_DisableUSBHSPHYPowerDown
  */
__STATIC_INLINE void LL_SYSCFG_DisableUSBHSPHYPowerDown(void)
{
  SET_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_PDCTRL);
}

/**
  * @brief  Check that USB HS PHY power-down is enabled.
  * @rmtoll
  *  OTGHSPHYCR    EN   LL_SYSCFG_IsEnabledUSBHSPHYPowerDown
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledUSBHSPHYPowerDown(void)
{
  return ((READ_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_PDCTRL) == (SYSCFG_OTGHSPHYCR_PDCTRL)) ? 1UL : 0UL);
}

/**
  * @brief  Set the USB HS PHY reference clock frequency selection.
  * @rmtoll
  *  OTGHSPHYCR   CLKSEL    LL_SYSCFG_SetUSBHSPHYReferenceClockFrequency
  * @param  clk_frequency This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_USBHSPHY_16MHZ
  *         @arg @ref LL_SYSCFG_USBHSPHY_19_2MHZ
  *         @arg @ref LL_SYSCFG_USBHSPHY_20MHZ
  *         @arg @ref LL_SYSCFG_USBHSPHY_24MHZ
  *         @arg @ref LL_SYSCFG_USBHSPHY_26MHZ
  *         @arg @ref LL_SYSCFG_USBHSPHY_32MHZ
  */
__STATIC_INLINE void LL_SYSCFG_SetUSBHSPHYReferenceClockFrequency(uint32_t clk_frequency)
{
  MODIFY_REG(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_CLKSEL, clk_frequency);
}

/**
  * @brief  Get the USB HS PHY reference clock frequency selection.
  * @rmtoll
  *  OTGHSPHYCR    CLKSEL   LL_SYSCFG_GetUSBHSPHYReferenceClockFrequency
  * @retval Returned the current applied reference clock frequency selection
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetUSBHSPHYReferenceClockFrequency(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->OTGHSPHYCR, SYSCFG_OTGHSPHYCR_CLKSEL));
}
#endif /* SYSCFG_OTGHSPHYCR_EN */

