STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_syscfg.h
#if defined(SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE)

/**
  * @brief  Set all USB HS PHY tune in same time.
  * @rmtoll
  *  OTGHSPHYTUNER2   COMPDISTUNE       LL_SYSCFG_SetConfigUSBHSPHY \n
  *  OTGHSPHYTUNER2   SQRXTUNE          LL_SYSCFG_SetConfigUSBHSPHY \n
  *  OTGHSPHYTUNER2   TXPREEMPAMPTUNE   LL_SYSCFG_SetConfigUSBHSPHY
  * @param  disconnect_threshold This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DIS_ADJUST_0_PERCENT
  *         @arg @ref LL_SYSCFG_DIS_ADJUST_PLUS_5_9_PERCENT
  * @param  squelch_threshold This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_SQUELCH_ADJUST_0_PERCENT
  *         @arg @ref LL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT
  * @param  src_current This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_NO
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_1
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_2
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_3
  */
__STATIC_INLINE void LL_SYSCFG_SetConfigUSBHSPHY(uint32_t disconnect_threshold,
                                                 uint32_t squelch_threshold,
                                                 uint32_t src_current)
{
  MODIFY_REG(SYSCFG->OTGHSPHYTUNER2, \
             (SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE | SYSCFG_OTGHSPHYTUNER2_SQRXTUNE |
              SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE),
             (src_current | squelch_threshold | disconnect_threshold));
}

/**
  * @brief  Set the USB PHY disconnect threshold adjustment.
  * @rmtoll
  *  OTGHSPHYTUNER2    COMPDISTUNE  LL_SYSCFG_SetUSBHSPHYDisconnectThresholdAdjustment
  * @param  disconnect_threshold This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_DIS_ADJUST_0_PERCENT
  *         @arg @ref LL_SYSCFG_DIS_ADJUST_PLUS_5_9_PERCENT
  */
__STATIC_INLINE void LL_SYSCFG_SetUSBHSPHYDisconnectThresholdAdjustment(uint32_t disconnect_threshold)
{
  MODIFY_REG(SYSCFG->OTGHSPHYTUNER2, SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE, disconnect_threshold);
}

/**
  * @brief  Get the USB PHY disconnect threshold adjustment.
  * @rmtoll
  *  OTGHSPHYTUNER2    COMPDISTUNE  LL_SYSCFG_GetUSBHSPHYDisconnectThresholdAdjustment
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_SQUELCH_ADJUST_0_PERCENT : 0 %
  *   @arg LL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT: +15%
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetUSBHSPHYDisconnectThresholdAdjustment(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->OTGHSPHYTUNER2, SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE));
}
#endif /* SYSCFG_OTGHSPHYTUNER2_COMPDISTUNE */

#if defined(SYSCFG_OTGHSPHYTUNER2_SQRXTUNE)
/**
  * @brief  Set the USB HS PHY squelch threshold adjustment.
  * @rmtoll
  *  OTGHSPHYTUNER2    SQRXTUNE  LL_SYSCFG_SetUSBHSPHYSquelchThresholdAdjustment
  * @param  squelch_threshold This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_SQUELCH_ADJUST_0_PERCENT
  *         @arg @ref LL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT
  */
__STATIC_INLINE void LL_SYSCFG_SetUSBHSPHYSquelchThresholdAdjustment(uint32_t squelch_threshold)
{
  MODIFY_REG(SYSCFG->OTGHSPHYTUNER2, SYSCFG_OTGHSPHYTUNER2_SQRXTUNE, squelch_threshold);
}

/**
  * @brief  Get the USB PHY squelch threshold adjustment.
  * @rmtoll
  *  OTGHSPHYTUNER2    SQRXTUNE  LL_SYSCFG_GetUSBHSPHYSquelchThresholdAdjustment
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_SQUELCH_ADJUST_0_PERCENT : 0 %
  *   @arg LL_SYSCFG_SQUELCH_ADJUST_PLUS_15_PERCENT: +15%
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetUSBHSPHYSquelchThresholdAdjustment(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->OTGHSPHYTUNER2, SYSCFG_OTGHSPHYTUNER2_SQRXTUNE));
}
#endif /* SYSCFG_OTGHSPHYTUNER2_SQRXTUNE */

#if defined(SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE)
/**
  * @brief  Set the USB HS PHY transmitter preemphasis current.
  * @rmtoll
  *  OTGHSPHYTUNER2    TXPREEMPAMPTUNE  LL_SYSCFG_SetUSBHSPHYTransmitterPreemphasisCurrent
  * @param  src_current This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_NO
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_1
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_2
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_3
  */
__STATIC_INLINE void LL_SYSCFG_SetUSBHSPHYTransmitterPreemphasisCurrent(uint32_t src_current)
{
  MODIFY_REG(SYSCFG->OTGHSPHYTUNER2, SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE, src_current);
}

/**
  * @brief  Set the USB HS PHY transmitter preemphasis current.
  * @rmtoll
  *  OTGHSPHYTUNER2    TXPREEMPAMPTUNE  LL_SYSCFG_GetUSBHSPHYTransmitterPreemphasisCurrent
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_NO
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_1
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_2
  *         @arg @ref LL_SYSCFG_SRC_CURRENT_3
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetUSBHSPHYTransmitterPreemphasisCurrent(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->OTGHSPHYTUNER2, SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE));
}
#endif /* SYSCFG_OTGHSPHYTUNER2_TXPREEMPAMPTUNE */

/**
  * @}
  */

/** @defgroup SYSCFG_LL_EF_ERASE_MEMORIE_STATUS SYSCFG ERASE MEMORIE STATUS
  * @{
  */

/**
  * @brief  Clear Status of End of Erase for ICACHE and PKA RAMs
  * @rmtoll
  *  MESR   IPMEE    LL_SYSCFG_ClearFlag_IPMEE
  */
__STATIC_INLINE void LL_SYSCFG_ClearFlag_IPMEE(void)
{
  SET_BIT(SYSCFG->MESR, SYSCFG_MESR_IPMEE);
}

/**
  * @brief  Get Status of End of Erase for ICACHE and PKA RAMs
  * @rmtoll
  *  MESR   IPMEE    LL_SYSCFG_IsActiveFlag_IPEE
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_IPMEE_ERASE_ON_GOING : Erase of memories not yet done
  *   @arg LL_SYSCFG_IPMEE_ERASE_ENDED: Erase of memories ended
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_IPEE(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->MESR, SYSCFG_MESR_IPMEE));
}

/**
  * @brief  Clear Status of End of Erase after reset  for SRAM2, BKPRAM, ICACHE, DCACHE,PKA rams
  * @rmtoll
  *  MESR   MCLR    LL_SYSCFG_ClearFlag_MCLR
  */
__STATIC_INLINE void LL_SYSCFG_ClearFlag_MCLR(void)
{
  SET_BIT(SYSCFG->MESR, SYSCFG_MESR_MCLR);
}

/**
  * @brief  Get Status of End of Erase after reset  for SRAM2, BKPRAM, ICACHE, DCACHE,PKA rams
  * @rmtoll
  *  MESR   MCLR    LL_SYSCFG_IsActiveFlag_MCLR
  * @retval Returned value can be one of the following values:
  *   @arg LL_SYSCFG_MCLR_ERASE_ON_GOING : Erase of memories not yet done
  *   @arg LL_SYSCFG_MCLR_ERASE_ENDED: Erase of memories ended
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsActiveFlag_MCLR(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->MESR, SYSCFG_MESR_MCLR));
}
/**
  * @}
  */

/** @defgroup SYSCFG_LL_EF_SYSCFG_Secure_Management Secure Management
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Configure Secure mode
  * @rmtoll
  *  SECCFGR     SYSCFGSEC     LL_SYSCFG_ConfigSecurity \n
  *  SECCFGR     CLASSBSEC     LL_SYSCFG_ConfigSecurity \n
  *  SECCFGR     FPUSEC        LL_SYSCFG_ConfigSecurity
  * @param  configuration This parameter must be the full combination
  *         of the following values:
  *         @arg @ref LL_SYSCFG_CLOCK_SEC or LL_SYSCFG_CLOCK_NSEC
  *         @arg @ref LL_SYSCFG_CLASSB_SEC or LL_SYSCFG_CLASSB_NSEC
  *         @arg @ref LL_SYSCFG_FPU_SEC or LL_SYSCFG_FPU_NSEC
  * @note   Only available from secure state when system implements security (TZEN=1)
  */
__STATIC_INLINE void LL_SYSCFG_ConfigSecurity(uint32_t configuration)
{
  WRITE_REG(SYSCFG->SECCFGR, configuration);
}
#endif /* __ARM_FEATURE_CMSE && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get Secure mode configuration
  * @rmtoll
  *  SECCFGR     SYSCFGSEC     LL_SYSCFG_GetConfigSecurity \n
  *  SECCFGR     CLASSBSEC     LL_SYSCFG_GetConfigSecurity \n
  *  SECCFGR     FPUSEC        LL_SYSCFG_GetConfigSecurity
  * @note   Only available when system implements security (TZEN=1)
  * @retval Returned value is the combination of the following values:
  *         @arg @ref LL_SYSCFG_CLOCK_SEC or LL_SYSCFG_CLOCK_NSEC
  *         @arg @ref LL_SYSCFG_CLASSB_SEC or LL_SYSCFG_CLASSB_NSEC
  *         @arg @ref LL_SYSCFG_FPU_SEC or LL_SYSCFG_FPU_NSEC
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetConfigSecurity(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->SECCFGR, 0xBU));
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock the SAU registers
  * @rmtoll
  *  CSLCKR     LOCKSAU        LL_SYSCFG_LockSAU
  * @note   Only available from secure state when system implements security (TZEN=1)
  */
__STATIC_INLINE void LL_SYSCFG_LockSAU(void)
{
  SET_BIT(SYSCFG->CSLCKR, SYSCFG_CSLCKR_LOCKSAU);
}

/**
  * @brief  Check if the SAU registers are locked or unlocked
  * @rmtoll
  *  CSLCKR    LOCKSAU   LL_SYSCFG_IsLockedSAU
  * @note   Only available from secure state when system implements security (TZEN=1)
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsLockedSAU(void)
{
  return ((READ_BIT(SYSCFG->CSLCKR, SYSCFG_CSLCKR_LOCKSAU) == (SYSCFG_CSLCKR_LOCKSAU)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Lock the MPU registers
  * @rmtoll
  *  CSLCKR      LOCKSMPU        LL_SYSCFG_LockMPU \n
  *  CNSLCKR     LOCKNSMPU       LL_SYSCFG_LockMPU
  * @note   Setting lock secure MPU depends on the privilege mode in secure/non-secure code
  */
__STATIC_INLINE void LL_SYSCFG_LockMPU(void)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(SYSCFG->CSLCKR, SYSCFG_CSLCKR_LOCKSMPU);
#else
  SET_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSMPU);
#endif /* __ARM_FEATURE_CMSE */
}

/**
  * @brief  Check if the MPU registers are locked or unlocked
  * @rmtoll
  *  CSLCKR     LOCKSMPU   LL_SYSCFG_IsLockedMPU \n
  *  CNSLCKR    LOCKNSMPU  LL_SYSCFG_IsLockedMPU
  * @note   Setting lock MPU depends on privilege mode in secure/non-secure code
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsLockedMPU(void)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(SYSCFG->CSLCKR, SYSCFG_CSLCKR_LOCKSMPU) == (SYSCFG_CSLCKR_LOCKSMPU)) ? 1UL : 0UL);
#else
  return ((READ_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSMPU) == (SYSCFG_CNSLCKR_LOCKNSMPU)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock the non-secure MPU registers
  * @rmtoll
  *  CNSLCKR      LOCKNSMPU        LL_SYSCFG_LockMPU_NS
  * @note   Setting lock non-secure MPU depends on privilege mode in secure/non-secure code
  */
__STATIC_INLINE void LL_SYSCFG_LockMPU_NS(void)
{
  SET_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSMPU);
}

/**
  * @brief  Check if the non-secure MPU registers are locked or unlocked
  * @rmtoll
  *  CNSLCKR    LOCKNSMPU   LL_SYSCFG_IsLockedMPU_NS
  * @note   Setting lock non-secure MPU depends on privilege mode in secure/non-secure code
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsLockedMPU_NS(void)
{
  return ((READ_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSMPU) == (SYSCFG_CNSLCKR_LOCKNSMPU)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @brief  Lock  the secure/ non-secure VTOR register
  * @rmtoll
  *  CSLCKR      LOCKSVTAIRCR        LL_SYSCFG_LockVTOR \n
  *  CNSLCKR     LOCKNSVTAIRCR       LL_SYSCFG_LockVTOR
  * @note   Setting lock secure VTOR depends on privilege mode in secure/non-secure code
  */
__STATIC_INLINE void LL_SYSCFG_LockVTOR(void)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SET_BIT(SYSCFG->CSLCKR, SYSCFG_CSLCKR_LOCKSVTAIRCR);
#else
  SET_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSVTOR);
#endif /* __ARM_FEATURE_CMSE */
}

/**
  * @brief  Check if the VTOR register is locked or unlocked
  * @rmtoll
  *  CSLCKR     LOCKSVTAIRCR   LL_SYSCFG_IsLockedVTOR \n
  *  CNSLCKR    LOCKNSVTOR     LL_SYSCFG_IsLockedVTOR
  * @note   Setting lock VTOR depends on privilege mode in secure/non-secure code
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsLockedVTOR(void)
{
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  return ((READ_BIT(SYSCFG->CSLCKR, SYSCFG_CSLCKR_LOCKSVTAIRCR) == (SYSCFG_CSLCKR_LOCKSVTAIRCR)) ? 1UL : 0UL);
#else
  return ((READ_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSVTOR) == (SYSCFG_CNSLCKR_LOCKNSVTOR)) ? 1UL : 0UL);
#endif /* __ARM_FEATURE_CMSE */
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Lock the non-secure VTOR register
  * @rmtoll
  *  CNSLCKR      LOCKNSVTOR        LL_SYSCFG_LockVTOR_NS
  * @note   Setting lock VTOR non-secure depends on privilege mode in secure/non-secure code
  */
__STATIC_INLINE void LL_SYSCFG_LockVTOR_NS(void)
{
  SET_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSVTOR);
}

/**
  * @brief  Check if the non-secure VTOR is locked or unlocked
  * @rmtoll
  *  CNSLCKR    LOCKNSVTOR   LL_SYSCFG_IsLockedVTOR_NS
  * @note   Setting lock non-secure VTOR depends on privilege mode in secure/non-secure code
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsLockedVTOR_NS(void)
{
  return ((READ_BIT(SYSCFG->CNSLCKR, SYSCFG_CNSLCKR_LOCKNSVTOR) == (SYSCFG_CNSLCKR_LOCKNSVTOR)) ? 1UL : 0UL);
}
#endif /* __ARM_FEATURE_CMSE */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_LL_SYSCFG_H */
